package market;

public class program {

	public static void main(String[] args) {
//		Спроектуйте простий інтернет-магазин, використовуючи концепції ООП, такі як інкапсуляція, конструктори,
//		статичні компоненти.
//		Спроектуйте додаток для керування інтернет-магазином, який включає наступні класи (в окремих файлах):
//		- Product (продукт) з полями: назва, бренд, ціна.
//		- Cart (кошик), який містить продукти та керує їх додаванням і видаленням.
//		- User (користувач) з полями: імʼя, ідентифікатор користувача, кошики (список кошиків користувача).
//		- OnlineStore (інтернет-магазин) для керування всіма користувачами та їх кошиками.
//		Реалізуйте по 2 конструктори з делегуванням для кожного класу, щоб забезпечити коректне створення обʼєктів.
//		Додайте фіналізатор у класі Product, який виводитиме повідомлення при видаленні обʼєкта продукту.
//		Додайте статичний метод у OnlineStore, який підраховуватиме загальну кількість продуктів у всіх кошиках.
//		Використовуйте статичний блок ініціалізації для встановлення початкових даних у класі OnlineStore.
//		Рішення викласти в публічний репозиторій, посилання на який надіслати в коментар до цього дз.
		
		
		Product product = new Product("Sneakers", "Nike", 50);
		product.showProduct();
		
		Card card = new Card("main", product);
		
		OnlineStore store = new OnlineStore();
		User user = new User("Dima", 1, card);
		
		store.addUser(user);
		

	}

}
